lvx/base/Documents/бит_НазначениеПравилТрансляции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бит_НазначениеПравилТрансляции</Name>
			<BasedOn>
				<xr:Item>Catalog.бит_ПравилаТрансляции</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.бит_НазначениеПравилТрансляции</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаСтруктурныхПодразделений</Name>
					<Comment>Группа структурных подразделений</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ГруппыСтруктурныхПодразделений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Comment>Дата начала действия правил трансляции</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Comment>Дата окончания действия правил трансляции</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Пользователь, ответственный за заполнение данного документа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Comment>Ручная корректировка (служебный реквизит)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПравилаТрансляции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПравилоТрансляции</Name>
							<Comment>Правило трансляции</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ПравилаТрансляции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Приоритет</Name>
							<Comment>Приоритет</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Назначение</Name>
							<Comment>Предназначено для</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.бит_НазначенияПравилТрансляции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Comment>Дата начала действия правила трансляции</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Comment>Дата окончания действия правила трансляции</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

lvx/base/Enums/бит_НазначенияПравилТрансляции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_НазначенияПравилТрансляции</Name>
			<Comment>(БИТ МУ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Трансляция</Name>
					<Comment>Трансляция</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодборСчетов</Name>
					<Comment>Подбор счетов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодборТиповПроводок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодборСчетовДляСверкиВГО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТрансляцияИПодборСчетов</Name>
					<Comment>Трансляция &amp; подбор счетов</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

lvx/base/Documents/бит_НазначениеПравилТрансляции/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.бит_ПравилаТрансляции") Тогда
		НоваяСтрокаПравил = ПравилаТрансляции.Добавить();
	    НоваяСтрокаПравил.ПравилоТрансляции = ДанныеЗаполнения;
		НоваяСтрокаПравил.Назначение = Перечисления.бит_НазначенияПравилТрансляции.Трансляция;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		Если ДанныеЗаполнения.Свойство("МассивПравил") Тогда
			ЗаполнитьПоНаборуПравилТрансляции(ДанныеЗаполнения.МассивПравил);
		Иначе
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		КонецЕсли; 
	КонецЕсли;
	
	ЗаполнитьШапкуДокумента();
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	бит_ОбщегоНазначенияПереопределяемый.ОбработкаПроведенияНачало(ЭтотОбъект);
	Если РучнаяКорректировка Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПроведения = Документы.бит_НазначениеПравилТрансляции.ПодготовитьПараметрыПроведения(Ссылка, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;	
	
	Документы.бит_НазначениеПравилТрансляции.СформироватьНазначениеПравилТрнасляции(
		ПараметрыПроведения.НазначениеПравилТрансляции, Движения, Отказ);
		
	Если ОбновитьДанныеСеанса() Тогда
		ОбновитьПовторноИспользуемыеЗначения();
	КонецЕсли; 
		
	бит_ОбщегоНазначенияПереопределяемый.ОбработкаПроведенияЗавершение(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	бит_ОбщегоНазначенияПереопределяемый.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	Если ОбновитьДанныеСеанса() Тогда
		ОбновитьПовторноИспользуемыеЗначения();
	КонецЕсли; 

КонецПроцедуры
	
Процедура ПриКопировании(ОбъектКопирования)
	
	ЗаполнитьШапкуДокумента(ОбъектКопирования);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;			
	КонецЕсли; 
	
	бит_ОбщегоНазначенияПереопределяемый.ПередЗаписьюДокумента(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ПроверитьНазначениеПравилЗаполненияПолей(Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьШапкуДокумента(ОбъектКопирования = Неопределено)
	
	Дата = ТекущаяДатаСеанса();
	
	// Заполнить реквизиты значениями по умолчанию.
	ДатаНачала = Дата;
		
	// Заполним шапку документа значениями по умолчанию.
	бит_ОбщегоНазначения.ЗаполнитьШапкуДокумента(ЭтотОбъект, Пользователи.ТекущийПользователь(), ОбъектКопирования);
	
КонецПроцедуры // ЗаполнитьШапкуДокумента()

Процедура ЗаполнитьПоНаборуПравилТрансляции(НаборПравил)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НаборПравил", НаборПравил);
	Запрос.УстановитьПараметр("ДатаНачала",  ТекущаяДатаСеанса());
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПравилаТрансляции.Ссылка КАК ПравилоТрансляции,
	|	ЗНАЧЕНИЕ(Перечисление.бит_НазначенияПравилТрансляции.Трансляция) КАК Назначение,
	|	&ДатаНачала КАК ДатаНачала
	|ИЗ
	|	Справочник.бит_ПравилаТрансляции КАК ПравилаТрансляции
	|ГДЕ
	|	НЕ ПравилаТрансляции.ЭтоГруппа
	|	И НЕ ПравилаТрансляции.ПометкаУдаления
	|	И ПравилаТрансляции.Ссылка В(&НаборПравил)";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ПравилаТрансляции.Добавить(), Выборка);
		НоваяСтрокаПравил = ПравилаТрансляции.Добавить();
	КонецЦикла;

КонецПроцедуры

Функция ОбновитьДанныеСеанса()

	Отбор 	  = Новый Структура("Назначение", Перечисления.бит_НазначенияПравилТрансляции.ПодборТиповПроводок);
	Результат = ПравилаТрансляции.НайтиСтроки(Отбор);

	Возврат ЗначениеЗаполнено(Результат);
	
КонецФункции

Процедура ПроверитьНазначениеПравилЗаполненияПолей(Отказ)
		
	ПравилаДляПроверки = Новый Массив; 
	Для каждого СтрокаТаблицы Из ПравилаТрансляции Цикл
		Если СтрокаТаблицы.Назначение = Перечисления.бит_НазначенияПравилТрансляции.Трансляция 
			ИЛИ СтрокаТаблицы.Назначение = Перечисления.бит_НазначенияПравилТрансляции.ТрансляцияИПодборСчетов Тогда
			ПравилаДляПроверки.Добавить(СтрокаТаблицы.ПравилоТрансляции);
		КонецЕсли;
	КонецЦикла; 
	
	Если НЕ ЗначениеЗаполнено(ПравилаДляПроверки) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПравилаДляПроверки", ПравилаДляПроверки);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПравилаТрансляции.Источник КАК Источник,
	|	ПравилаТрансляции.Приемник КАК Приемник,
	|	ПравилаТрансляции.Ссылка КАК Правило,
	|	ПравилаТрансляции.ПометкаУдаления КАК ПометкаУдаления
	|ПОМЕСТИТЬ ВТСписокПравил
	|ИЗ
	|	Справочник.бит_ПравилаТрансляции КАК ПравилаТрансляции
	|ГДЕ
	|	ПравилаТрансляции.Ссылка В(&ПравилаДляПроверки)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НазначениеПравилЗаполненияПриТрансляции.Источник КАК Источник,
	|	НазначениеПравилЗаполненияПриТрансляции.Приемник КАК Приемник
	|ПОМЕСТИТЬ ВТНазначениеПравилДляПолей
	|ИЗ
	|	РегистрСведений.бит_НазначениеПравилЗаполненияПриТрансляции КАК НазначениеПравилЗаполненияПриТрансляции
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСписокПравил КАК ВТСписокПравил
	|		ПО НазначениеПравилЗаполненияПриТрансляции.Источник = ВТСписокПравил.Источник
	|			И НазначениеПравилЗаполненияПриТрансляции.Приемник = ВТСписокПравил.Приемник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТСписокПравил.Правило КАК Правило,
	|	ВТНазначениеПравилДляПолей.Источник ЕСТЬ NULL КАК НетПравилЗаполненияПолей,
	|	ВТСписокПравил.ПометкаУдаления КАК ПометкаУдаления
	|ИЗ
	|	ВТСписокПравил КАК ВТСписокПравил
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНазначениеПравилДляПолей КАК ВТНазначениеПравилДляПолей
	|		ПО ВТСписокПравил.Источник = ВТНазначениеПравилДляПолей.Источник
	|			И ВТСписокПравил.Приемник = ВТНазначениеПравилДляПолей.Приемник";	
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Для каждого СтрокаТаблицы Из ПравилаТрансляции Цикл
		
		Поле = "ПравилаТрансляции[%1].ПравилоТрансляции";
		Поле = СтрШаблон(Поле, Формат(СтрокаТаблицы.НомерСтроки - 1, "ЧН=0; ЧГ="));
		РезультатПоиска = Результат.Найти(СтрокаТаблицы.ПравилоТрансляции, "Правило");
		
		Если РезультатПоиска.ПометкаУдаления Тогда
			ШаблонСообщения = НСтр("ru = 'Правило трансляции помечено на удаление.';
									|en = 'The сonversion rule is marked for deletion.'");
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("КОЛОНКА", "КОРРЕКТНОСТЬ",
								НСтр("ru = 'Правило'"), СтрокаТаблицы.НомерСтроки, 
								НСтр("ru = 'Правила трансляции'"), ШаблонСообщения);
			
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
		КонецЕсли;
		
		Если НЕ (СтрокаТаблицы.Назначение = Перечисления.бит_НазначенияПравилТрансляции.Трансляция 
			ИЛИ СтрокаТаблицы.Назначение =  Перечисления.бит_НазначенияПравилТрансляции.ТрансляцияИПодборСчетов) Тогда
			Продолжить;			
		КонецЕсли;

		Если РезультатПоиска.НетПравилЗаполненияПолей Тогда
			ШаблонСообщения = НСтр("ru = 'Нет зарегистрированных правил заполнения полей.'; 
									|en = 'There are no registered rules for filling in fields.'") ;
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("КОЛОНКА", "КОРРЕКТНОСТЬ",
								НСтр("ru = 'Правило'"), СтрокаТаблицы.НомерСтроки, 
								НСтр("ru = 'Правила трансляции'"), ШаблонСообщения);
			
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли
